<html>
<head>
	<style>
	.main-body {
		float:left;
		background-image: url('img/Ogu.png');
		background-repeat: no-repeat;
	}
	.content {
		position:absolute;
		margin-left: 250;
		margin-right:100;
		}
	</style>
</head>
<body class="main-body">
	<a href="https://github.com/lnds/Ogu"><img style="position: absolute; top: 0; right: 0; border: 0;" src="https://s3.amazonaws.com/github/ribbons/forkme_right_green_007200.png" alt="Fork me on GitHub"></a>
		
	<div class="content">
		<h1>Ogu</h1>

<table>
	<tr><th>ESPA&Ntilde;OL</th><th>&nbsp;</th><th>ENGLISH</th></tr>
	<tr>
<td>
	<p>Ogu es un nuevo lenguaje de programaci&oacute;n en desarrollo.
		Inicialmente correr&aacute; en los ambientes que soporten la Java Virtual Machine, pero planeamos disponibilizarlo
		en .Net y eventualmente compilar en c&oacute;digo de m&aacute;quina nativo.
	</p>
	<p>Puedes unirte a nuestro esfuerzo partiendo por clonar nuestro repositorio en github y comenzar a programar, esperamos tus contribuciones!</p>
	<h2>Pendientes</h2>
	<li>Escribir la descripci&oacute;n formal del lenguaje</li>
	<li>El compilador disponible s&oacute;lo ejecuta el analisis l&eacute;xico y sint&aacute;ctico.
	</li>
	<li>Completar 
		la fase de dise&ntilde;o de gran parte de la sem&aacute;ntica del lenguaje y luego debemos generar c&oacute;digo</li>
	<li>Escribir una biblioteca de tiempo de ejecuci&oacute;n</li>
	<li>Terminar este sitio web</li>
</ul>
</p>
<p>
	Puedes clonar nuestro repositorio en GitHub: <a href="https://github.com/lnds/Ogu">https://github.com/lnds/Ogu</a>
</p>

</td>
<td>&nbsp;</td>
		<td valign="top">
		<p>Ogu is a new programming language in development stage.</p>
		<p>If you are fluent in english and want to contibute, please send an email to admin@ogu-lang.org, we need you to 
			help us translate this site and the documentation</p>
			<p>Meanwhile you can fork the code if you want, our repository on github is located at: <a href="https://github.com/lnds/Ogu">https://github.com/lnds/Ogu</a>
</td>

</tr>
</table>

<h3>Sobre nuestra mascota</h3>

<p>Nuesta mascota es &Oacute;gu, la caricatura de un cavern&iacute;cola creado por el gran artista chileno Themo Lobos, la imagen es usada con la debida
autorizaci&oacute;n de &eacute;l para uso exclusivo de este proyecto y sin fines de lucro.
</p>
<h3>Copyright</h3>
<p>El c&oacute;digo de Ogu es opensource y se distribuye bajo una licencias BSD, ver el archivo LICENSE  en el repositorio para los detalles.</p> 
<p>(c) 2011 Eduardo D&iacute;az Cort&eacute;s para todo el contenido de este sitio con excepci&oacute;n de la imagen de &Oacute;gu<p>
<p>Todos los derechos sobre la imagen de &Oacute;gu pertenecen a Themo Lobos y sus herederos, usados con autorizaci&oacute;n<p>

	</body>
</html>